updated readme with better graphics
